In [18]:
import pandas as pd
import matplotlib.pyplot as plt

In [19]:
data = pd.read_csv("test.csv")

In [20]:
data.head()

      name  age  height  weight
0    brian   36     180      80
1  meshack  320     170      82

In [21]:
data.shape

(2, 4)

In [22]:
data.describe()

              age      height     weight
count    2.000000    2.000000   2.000000
mean   178.000000  175.000000  81.000000
std    200.818326    7.071068   1.414214
min     36.000000  170.000000  80.000000
25%    107.000000  172.500000  80.500000
50%    178.000000  175.000000  81.000000
75%    249.000000  177.500000  81.500000
max    320.000000  180.000000  82.000000

In [23]:
data['bmi'] = data['weight'] / data['height'] ** 2

In [24]:
data

      name  age  height  weight       bmi
0    brian   36     180      80  0.002469
1  meshack  320     170      82  0.002837

In [27]:
plt.bar(x=data['height'], y=data['bmi'])

TypeError: bar() missing 1 required positional argument: 'height'